app/controllers/playlists_controller.rb

INSERT INTO "playlists" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 15 Feb 2014 21:43:17 UTC +00:00], ["name", "One"], ["updated_at", Sat, 15 Feb 2014 21:43:17 UTC +00:00]]
---
  def create
    @playlist = Playlist.new(playlist_params)

    respond_to do |format|
      if @playlist.save

DELETE FROM "playlists" WHERE "playlists"."id" = ?  [["id", 1]]
---
  def destroy
    @playlist.destroy