app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("artist", "created_at", "date_added", "source", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["artist", "ha"], ["created_at", Sun, 16 Feb 2014 01:46:15 UTC +00:00], ["date_added", "ha"], ["source", "ha"], ["title", "ha"], ["updated_at", Sun, 16 Feb 2014 01:46:15 UTC +00:00]]

  def update
    respond_to do |format|
      if @song.update(song_params)
---
UPDATE "songs" SET "source" = ?, "updated_at" = ? WHERE "songs"."id" = 3  [["source", "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/yr01fJwzcks\" frameborder=\"0\" allowfullscreen></iframe>"], ["updated_at", Sun, 16 Feb 2014 02:39:22 UTC +00:00]]