app/views/playlists/show.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."playlist_id" = ?  [[nil, 3]]
---
 <tbody>
      <% @playlist.songs.each do |song| %>